In [1]:
import pandas as pd
from datetime import datetime

In [2]:
## Datasets
df_a = pd.read_csv("a.case_cust_data_mod_v1.csv")
df_b = pd.read_csv("b.case_data_sc_txn_mod_v1.csv")

In [3]:
df_a.head(10)

,customer_unique_key,customer_salary,customer_age_year,customer_pincode,customer_city
0,3207157596,23154.0,27,122505.0,Delhi
1,3114584060,88419.0,47,411048.0,Pune
2,3343473429,73334.0,37,500081.0,Hyderabad
3,2956923386,54173.0,35,411014.0,Pune
4,3211707503,43183.0,41,560100.0,Bengaluru
5,3186522561,55822.0,34,530016.0,Visakhapatnam
6,2733101467,67871.0,36,600037.0,Chennai
7,3049704097,78570.0,39,600125.0,Chennai
8,2524675797,81587.0,43,201305.0,Delhi
9,2768607070,36942.0,33,603103.0,Chennai

In [4]:
df_b.head(10)

,transaction_id,customer_unique_key,transaction_status,transaction_merchant_category,transaction_amount,transaction_date,transaction_time
0,10512,2869834181,Fail,Shopping,8078.0,01-08-2021,11:06:14
1,88884,2523046473,Fail,Online Food,2138.0,01-08-2021,11:40:54
2,170010,2905056225,Fail,Shopping,122.0,01-08-2021,14:24:33
3,191864,3631953987,Fail,Shopping,288.0,01-08-2021,14:39:53
4,183790,2683540497,Fail,Shopping,3561.0,01-08-2021,17:31:17
5,393972,2533371438,Fail,Shopping,752.0,01-08-2021,18:32:27
6,3456701,2774842324,Success,Shopping,100000.0,01-08-2021,18:32:27
7,430388,3386184469,Fail,Grocery,8650.0,01-08-2021,19:24:56
8,691920,2361880128,Fail,Shopp$#2ing,774.0,01-08-2021,22:48:17
9,207945,3458379027,Fail,Grocery,2718.0,01-08-2021,23:36:30

In [5]:
## Joining both the Tables together.
df_join = pd.merge(df_a, df_b, on='customer_unique_key')

In [6]:
df_join.head()

,customer_unique_key,customer_salary,customer_age_year,customer_pincode,customer_city,transaction_id,transaction_status,transaction_merchant_category,transaction_amount,transaction_date,transaction_time
0,3207157596,23154.0,27,122505.0,Delhi,1920621100,Success,Shopping,1309.0,28-11-2021,12:16:28
1,3114584060,88419.0,47,411048.0,Pune,1471654513,Success,NaN,681.0,19-08-2021,16:11:24
2,3114584060,88419.0,47,411048.0,Pune,371662642,Success,Shopping,2613.0,20-08-2021,10:56:10
3,3114584060,88419.0,47,411048.0,Pune,1152147720,Success,NaN,841.0,20-08-2021,11:45:21
4,3114584060,88419.0,47,411048.0,Pune,1198708556,Success,Grocery,4326.0,22-08-2021,19:03:03

In [7]:
df_join.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 160039 entries, 0 to 160038
Data columns (total 11 columns):
 #   Column                         Non-Null Count   Dtype
---  ------                         --------------   -----
 0   customer_unique_key            160039 non-null  int64
 1   customer_salary                159829 non-null  float64
 2   customer_age_year              160039 non-null  int64
 3   customer_pincode               159755 non-null  float64
 4   customer_city                  160037 non-null  object
 5   transaction_id                 160039 non-null  int64
 6   transaction_status             160039 non-null  object
 7   transaction_merchant_category  158422 non-null  object
 8   transaction_amount             160029 non-null  float64
 9   transaction_date               160039 non-null  object
 10  transaction_time               160039 non-null  object
dtypes: float64(3), int64(3), object(5)
memory usage: 14.7+ MB

In [8]:
## Checking for Null Values
df_join.isnull().sum()

customer_unique_key                 0
customer_salary                   210
customer_age_year                   0
customer_pincode                  284
customer_city                       2
transaction_id                      0
transaction_status                  0
transaction_merchant_category    1617
transaction_amount                 10
transaction_date                    0
transaction_time                    0
dtype: int64

In [9]:
## Removing Null values
df_join.dropna(how = 'any', inplace = True)

In [10]:
df_join.isnull().sum()

customer_unique_key              0
customer_salary                  0
customer_age_year                0
customer_pincode                 0
customer_city                    0
transaction_id                   0
transaction_status               0
transaction_merchant_category    0
transaction_amount               0
transaction_date                 0
transaction_time                 0
dtype: int64

In [11]:
## 1913 rows dropped.
df_join.shape

(158126, 11)

In [ ]:
## Checking for All the unique values in categorical Columns

In [12]:
df_join['transaction_status'].unique()

array(['Success', 'Fail'], dtype=object)

In [13]:
df_join['transaction_merchant_category'].unique()

array(['Shopping', 'Grocery', 'Other', 'Travel', 'Ecom', 'Fashion',
       'Telecom', 'Misc', 'Online Food', 'EcoM', 'Shopping#$#',
       'Shopping&%$', 'ShoppinG', 'Fashion&%$', 'Shopping$%', 'ShoPping',
       'Fashion#$45', 'Ec&om', 'Gro%cery', 'OnlinE Food',
       'Online Food$%7', 'EcoN', 'Gr^5ocery', 'Shop#$%ping',
       'Shopping@24$', 'E#%com', 'Shopp$#2ing', 'Online Food#$#',
       'Shopping#@#', 'Shopping^$%', 'Shopping12$#', 'Shopping#$5',
       'Ecom#$#', 'Other&%$', 'Te#$lecom', 'Travel$%', 'ShOpping',
       'Ecom$%^'], dtype=object)

In [15]:
## using Regular Expressions to remove spelling mistakes
import re
def clean_category_name(category_name):
    category_name = re.sub('[^A-Za-z]+', '', category_name)
    if category_name.lower() == 'econ':
        category_name = 'ecom'
    return category_name

In [18]:
df_join['transaction_merchant_category'] = df_join['transaction_merchant_category'].apply(clean_category_name).str.lower()

In [19]:
df_join['transaction_merchant_category'].unique()

array(['shopping', 'grocery', 'other', 'travel', 'ecom', 'fashion',
       'telecom', 'misc', 'onlinefood'], dtype=object)

In [ ]:
## Checking for invalid values such as negative age:

In [22]:
(df_join['customer_age_year'] < 0).sum()

61

In [23]:
df_join = df_join[df_join['customer_age_year']>0]

In [25]:
## 61 rows dropped which had negative age.
df_join.shape

(158061, 11)

In [26]:
df_join = df_join[df_join['customer_age_year'] < 110]

In [27]:
(df_join['customer_age_year'] < 110).sum()

158061

In [28]:
(df_join['transaction_amount'] < 0).sum()

12

In [29]:
df_join = df_join[df_join['transaction_amount'] > 0]

In [30]:
(df_join['transaction_amount'] < 0).sum()

0

In [31]:
## Negative Customer Salary
(df_join['customer_salary'] < 0).sum()

37

In [32]:
df_join = df_join[df_join['customer_salary'] > 0]

In [34]:
## Looking for duplicate rows and Dropping the duplicates
duplicate_rows = df_join[df_join.duplicated()]
duplicate_rows

,customer_unique_key,customer_salary,customer_age_year,customer_pincode,customer_city,transaction_id,transaction_status,transaction_merchant_category,transaction_amount,transaction_date,transaction_time
49949,2774842324,63496.0,35,625016.0,Madurai,3456701,Success,shopping,100000.0,01-08-2021,18:32:27
49950,2774842324,63496.0,35,625016.0,Madurai,3456701,Success,shopping,100000.0,01-08-2021,18:32:27

In [35]:
df_join.drop_duplicates(inplace=True)

In [36]:
duplicate_rows = df_join[df_join.duplicated()]
duplicate_rows

Empty DataFrame
Columns: [customer_unique_key, customer_salary, customer_age_year, customer_pincode, customer_city, transaction_id, transaction_status, transaction_merchant_category, transaction_amount, transaction_date, transaction_time]
Index: []

In [37]:
## Removing Wrongly entered Transaction_time Entries:
df_join['transaction_time'] = df_join['transaction_time'].str.replace('1900-01-01T', '')

In [59]:
df_join['transaction_date'] = pd.to_datetime(df_join['transaction_date'], format='%Y-%m-%d').dt.strftime('%Y-%m-%d)

In [41]:
df_join.head()

,customer_unique_key,customer_salary,customer_age_year,customer_pincode,customer_city,transaction_id,transaction_status,transaction_merchant_category,transaction_amount,transaction_date,transaction_time
0,3207157596,23154.0,27,122505.0,Delhi,1920621100,Success,shopping,1309.0,28-11-2021,12:16:28
2,3114584060,88419.0,47,411048.0,Pune,371662642,Success,shopping,2613.0,20-08-2021,10:56:10
4,3114584060,88419.0,47,411048.0,Pune,1198708556,Success,grocery,4326.0,22-08-2021,19:03:03
5,3114584060,88419.0,47,411048.0,Pune,1292490882,Success,other,6176.0,13-09-2021,19:10:31
6,3114584060,88419.0,47,411048.0,Pune,2308969908,Success,travel,4593.0,19-09-2021,18:59:36

In [60]:
df_join.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 157993 entries, 0 to 160038
Data columns (total 11 columns):
 #   Column                         Non-Null Count   Dtype
---  ------                         --------------   -----
 0   customer_unique_key            157993 non-null  int64
 1   customer_salary                157993 non-null  float64
 2   customer_age_year              157993 non-null  int64
 3   customer_pincode               157993 non-null  float64
 4   customer_city                  157993 non-null  object
 5   transaction_id                 157993 non-null  int64
 6   transaction_status             157993 non-null  object
 7   transaction_merchant_category  157993 non-null  object
 8   transaction_amount             157993 non-null  float64
 9   transaction_date               157993 non-null  object
 10  transaction_time               157993 non-null  object
dtypes: float64(3), int64(3), object(5)
memory usage: 14.5+ MB

In [61]:
df_join.describe()

,customer_unique_key,customer_salary,customer_age_year,customer_pincode,transaction_id,transaction_amount
count,1.579930e+05,1.579930e+05,157993.000000,157993.000000,1.579930e+05,1.579930e+05
mean,3.016511e+09,5.908579e+04,33.247872,427376.939339,3.999905e+09,4.187634e+03
std,4.332035e+08,9.304361e+04,6.230305,179531.366403,3.150547e+09,7.980959e+04
min,2.333304e+09,3.355000e+03,21.000000,0.000000,1.051200e+04,1.000000e+00
25%,2.670559e+09,3.307300e+04,29.000000,302021.000000,1.455266e+09,8.850000e+02
50%,2.983253e+09,4.444700e+04,32.000000,500032.000000,3.183343e+09,1.517000e+03
75%,3.228886e+09,6.676400e+04,37.000000,560066.000000,5.934126e+09,3.529000e+03
max,4.112153e+09,1.117007e+07,62.000000,855107.000000,1.434174e+10,9.999999e+06

In [52]:
# Saving the file to an Excel File
df_join.to_excel('Case_study_Data_Cleaned.xlsx', index=False)